; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v10)
             (pred_9 ?v8 ?v13)
             (pred_5 ?v6 ?v13)
             (pred_12 ?v5 ?v6 )
	     (pred_6 ?v6)
             (pred_2 ?v7)
             (pred_10 ?v8)
             (pred_3 ?v13)
             (pred_7 ?v6)
             (pred_8 ?v8)
             (pred_1 ?v6)
             (pred_4 ))



(:action op_1
:parameters (?v12 ?v1 ?v11 ?v2)
:precondition (and (pred_2 ?v12) (pred_2 ?v1) (pred_10 ?v11) (pred_3 ?v2)
          (pred_11 ?v12 ?v1) (pred_9 ?v11 ?v2)
                   (pred_5 ?v1 ?v2) (pred_6 ?v12) 
                   (pred_7 ?v1) (pred_8 ?v11))
:effect (and  (pred_1 ?v1) (not (pred_7 ?v1))))


(:action op_3
:parameters (?v12 ?v9)
:precondition (and (pred_2 ?v12) (pred_2 ?v9)
               (pred_6 ?v12) (pred_11 ?v12 ?v9) (pred_1 ?v9))
:effect (and (pred_6 ?v9) (not (pred_6 ?v12))))

(:action op_4
:parameters (?v12 ?v11)
:precondition (and (pred_2 ?v12) (pred_10 ?v11) 
                  (pred_6 ?v12) (pred_12 ?v11 ?v12) (pred_4 ))
:effect (and (pred_8 ?v11)
   (not (pred_12 ?v11 ?v12)) (not (pred_4 ))))


(:action op_5
:parameters (?v12 ?v3 ?v4)
:precondition (and (pred_2 ?v12) (pred_10 ?v3) (pred_10 ?v4)
                  (pred_6 ?v12) (pred_8 ?v4) (pred_12 ?v3 ?v12))
:effect (and (pred_8 ?v3) (pred_12 ?v4 ?v12)
        (not (pred_8 ?v4)) (not (pred_12 ?v3 ?v12))))

(:action op_2
:parameters (?v12 ?v11)
:precondition (and (pred_2 ?v12) (pred_10 ?v11) 
                  (pred_6 ?v12) (pred_8 ?v11))
:effect (and (pred_4 ) (pred_12 ?v11 ?v12) (not (pred_8 ?v11)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_01 obj_29 obj_22 obj_06 obj_14 obj_23 obj_02 obj_03 obj_20 obj_09 obj_32 obj_15 obj_12 obj_31 obj_27 obj_10 obj_19 obj_24 obj_11 obj_21 obj_18 obj_05 obj_13 obj_08 obj_26
    obj_25 obj_04 obj_30
    obj_07 obj_28 obj_16 obj_17
    )

    (:init
       (pred_4)

       (pred_2 obj_01)
       (pred_2 obj_29)
       (pred_2 obj_22)
       (pred_2 obj_06)
       (pred_2 obj_14)
       (pred_2 obj_23)
       (pred_2 obj_02)
       (pred_2 obj_03)
       (pred_2 obj_20)
       (pred_2 obj_09)
       (pred_2 obj_32)
       (pred_2 obj_15)
       (pred_2 obj_12)
       (pred_2 obj_31)
       (pred_2 obj_27)
       (pred_2 obj_10)
       (pred_2 obj_19)
       (pred_2 obj_24)
       (pred_2 obj_11)
       (pred_2 obj_21)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_13)
       (pred_2 obj_08)
       (pred_2 obj_26)
       (pred_3 obj_25)
       (pred_3 obj_04)
       (pred_3 obj_30)
       (pred_10 obj_07)
       (pred_10 obj_28)
       (pred_10 obj_16)
       (pred_10 obj_17)

       (pred_11 obj_01 obj_23)
       (pred_11 obj_01 obj_29)
       (pred_11 obj_29 obj_02)
       (pred_11 obj_29 obj_22)
       (pred_11 obj_29 obj_01)
       (pred_11 obj_22 obj_03)
       (pred_11 obj_22 obj_06)
       (pred_11 obj_22 obj_29)
       (pred_11 obj_06 obj_20)
       (pred_11 obj_06 obj_14)
       (pred_11 obj_06 obj_22)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_06)
       (pred_11 obj_23 obj_32)
       (pred_11 obj_23 obj_02)
       (pred_11 obj_23 obj_01)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_02 obj_03)
       (pred_11 obj_02 obj_29)
       (pred_11 obj_02 obj_23)
       (pred_11 obj_03 obj_12)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_22)
       (pred_11 obj_03 obj_02)
       (pred_11 obj_20 obj_31)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_06)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_09 obj_27)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_32 obj_10)
       (pred_11 obj_32 obj_15)
       (pred_11 obj_32 obj_23)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_32)
       (pred_11 obj_12 obj_24)
       (pred_11 obj_12 obj_31)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_31 obj_11)
       (pred_11 obj_31 obj_27)
       (pred_11 obj_31 obj_20)
       (pred_11 obj_31 obj_12)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_09)
       (pred_11 obj_27 obj_31)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_19)
       (pred_11 obj_10 obj_32)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_24)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_10)
       (pred_11 obj_24 obj_13)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_24 obj_12)
       (pred_11 obj_24 obj_19)
       (pred_11 obj_11 obj_08)
       (pred_11 obj_11 obj_21)
       (pred_11 obj_11 obj_31)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_21 obj_26)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_11)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_05 obj_13)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_13 obj_08)
       (pred_11 obj_13 obj_24)
       (pred_11 obj_13 obj_05)
       (pred_11 obj_08 obj_26)
       (pred_11 obj_08 obj_11)
       (pred_11 obj_08 obj_13)
       (pred_11 obj_26 obj_21)
       (pred_11 obj_26 obj_08)
       (pred_7 obj_26)
       (pred_7 obj_06)
       (pred_7 obj_01)
       (pred_7 obj_27)
       (pred_5  obj_26 obj_25)
       (pred_5  obj_06 obj_04)
       (pred_5  obj_01 obj_30)
       (pred_5  obj_27 obj_25)
       (pred_1 obj_29)
       (pred_1 obj_22)
       (pred_1 obj_14)
       (pred_1 obj_23)
       (pred_1 obj_02)
       (pred_1 obj_03)
       (pred_1 obj_20)
       (pred_1 obj_09)
       (pred_1 obj_32)
       (pred_1 obj_15)
       (pred_1 obj_12)
       (pred_1 obj_31)
       (pred_1 obj_10)
       (pred_1 obj_19)
       (pred_1 obj_24)
       (pred_1 obj_11)
       (pred_1 obj_21)
       (pred_1 obj_18)
       (pred_1 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_08)

       (pred_9  obj_07 obj_25)
       (pred_9  obj_28 obj_04)
       (pred_9  obj_16 obj_30)
       (pred_9  obj_17 obj_04)
       (pred_12 obj_07 obj_23)
       (pred_12 obj_28 obj_14)
       (pred_12 obj_16 obj_22)
       (pred_12 obj_17 obj_21)
       (pred_6 obj_18)
    )

    (:goal (and
       (pred_12 obj_16 obj_03)
       (pred_12 obj_17 obj_29)
    ))
(:constraints
  (always (not (pred_6 obj_24)))
)
)

; plan
1. (op_3 obj_18 obj_10)
   deleted: (pred_6 obj_18)
   added: (pred_6 obj_10)
   goals met: 0 of 2
2. (op_3 obj_10 obj_19)
   deleted: (pred_6 obj_10)
   added: (pred_6 obj_19)
   goals met: 0 of 2
3. (op_3 obj_19 obj_15)
   deleted: (pred_6 obj_19)
   added: (pred_6 obj_15)
   goals met: 0 of 2
4. (op_3 obj_15 obj_12)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_12)
   goals met: 0 of 2
5. (op_3 obj_12 obj_31)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_31)
   goals met: 0 of 2
6. (op_3 obj_31 obj_11)
   deleted: (pred_6 obj_31)
   added: (pred_6 obj_11)
   goals met: 0 of 2
7. (op_3 obj_11 obj_21)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_21)
   goals met: 0 of 2
8. (op_4 obj_21 obj_17)
   deleted: (pred_12 obj_17 obj_21) (pred_4)
   added: (pred_8 obj_17)
   goals met: 0 of 2
9. (op_3 obj_21 obj_11)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_11)
   goals met: 0 of 2
10. (op_3 obj_11 obj_31)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_31)
   goals met: 0 of 2
11. (op_3 obj_31 obj_20)
   deleted: (pred_6 obj_31)
   added: (pred_6 obj_20)
   goals met: 0 of 2
12. (op_3 obj_20 obj_03)
   deleted: (pred_6 obj_20)
   added: (pred_6 obj_03)
   goals met: 0 of 2
13. (op_3 obj_03 obj_22)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_22)
   goals met: 0 of 2
14. (op_3 obj_22 obj_29)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_29)
   goals met: 0 of 2
15. (op_2 obj_29 obj_17)
   deleted: (pred_8 obj_17)
   added: (pred_4) (pred_12 obj_17 obj_29)
   goals met: 1 of 2
16. (op_3 obj_29 obj_22)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_22)
   goals met: 1 of 2
17. (op_4 obj_22 obj_16)
   deleted: (pred_12 obj_16 obj_22) (pred_4)
   added: (pred_8 obj_16)
   goals met: 1 of 2
18. (op_3 obj_22 obj_03)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_03)
   goals met: 1 of 2
19. (op_2 obj_03 obj_16)
   deleted: (pred_8 obj_16)
   added: (pred_4) (pred_12 obj_16 obj_03)
   goals met: 2 of 2
